content/daily/2022-05-05.md
+++
title = "2022-05-05"
author = ["System Administrator"]
tags = ["draft", "draft"]
draft = false
+++

## timer related functions {#timer-related-functions}


### <span class="org-todo todo TODO">TODO</span> find a way to wrtie background timer {#find-a-way-to-wrtie-background-timer}

is there built in function doing that?
is there libraries doing that?


#### in elisp builtin {#in-elisp-builtin}

<https://www.gnu.org/software/emacs/manual/html_node/elisp/Timers.html>
run-with-timer

```emacs-lisp
(defun testfunc ()
  "docstring"
  (message "hi!")
  )
```

<!--list-separator-->

-  run-with-timer secs repeat function args

<!--list-separator-->

-  parse time

    (org-duration-to-minutes "2:00")

<!--list-separator-->

-  conversion between string and symbol

    (intern string)
    keyword is symbol start with ":", so
    (keyword string) should be like (intern (concat ":" string))


### <span class="org-todo todo TODO">TODO</span> timer information functions {#timer-information-functions}


#### <span class="org-todo done DONE">DONE</span> current stage elapsed/remaining {#current-stage-elapsed-remaining}

look up how long have this stage taken(how long this dumping,bar,rest,releasing have taken). and how long till effort.


#### <span class="org-todo done DONE">DONE</span> current session elapsed/remaining {#current-session-elapsed-remaining}

look up how long since the session started, and how there is long to its said time


#### <span class="org-todo todo TODO">TODO</span> time statistic {#time-statistic}

over all bar time, rest time, dumping+rest+releasing, all time,


### <span class="org-todo todo TODO">TODO</span> timer behaviours {#timer-behaviours}


#### <span class="org-todo done DONE">DONE</span> environment set up {#environment-set-up}

<!--list-separator-->

- <span class="org-todo done DONE">DONE</span>  first set the timer length


#### <span class="org-todo todo TODO">TODO</span> session timer {#session-timer}

1.  [X] a time prompted when entering session
2.  [X] when near up (10m before), prompt, "extend?", if no input, no extend
3.  [ ] when up, if soft, do 1 from `dedicated-session-bar-time-up-soft-actions-alist`
    -   insert at point "session time up"
    -   message
    -   switch to buffer with (you should rest now)
    -   change the frame to only 2 window, up is large font (you should rest now), low is currently working buffer
4.  [ ] if hard, call releasing.


#### <span class="org-todo todo TODO">TODO</span> bar timer {#bar-timer}

doing timer would:

1.  [X] set timer with `dedicated-session-bar-time` (if nil, set it with bar 1's duration after bar 1's over)
2.  [ ] when timer's up, if soft(40), do a behaviour in `dedicated-session-bar-time-up-soft-actions-alist`
    -   insert at point "you should rest now"
    -   message
    -   switch to buffer with (you should rest now)
    -   change the frame to only 2 window, up is large font (you should rest now), low is currently working buffer
3.  [ ] when timer's up if hard(40!), do a behavioour in `dedicated-session-bar-time-up-hard-actions-alist`
    -   toggle between bar and rest
    -   save and kill current working buffer, goto rest. after rest, open that buffer again.


#### <span class="org-todo todo TODO">TODO</span> set soft/hard session/stage time {#set-soft-hard-session-stage-time}

a soft session time is suggestion, and will tell you the time is up when there's little remaining time. the same goes to the bar time

a hard session time is strict, will terminate doing 10m before the session is over. a hard bar time will terminate the bar(start rest) when the timer's up


## Log related functions {#log-related-functions}


### <span class="org-todo todo TODO">TODO</span> look up logs {#look-up-logs}


## prompt text including the goal/standard of each rest/bar {#prompt-text-including-the-goal-standard-of-each-rest-bar}

bar's quitting standard is head begin to mess
rest's finishing benchmark is head clear again